Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--mapproxy_overview.tmx
Source language: en
Languages: ja

source: Proxy WMS & tile services
ja: Proxy WMS & タイル サービス

source: MapProxy speeds up mapping applications by pre-rendering and integrating maps from multiple sources and storing in a local cache. Layers can be made transparent, projections can be changed, multiple map layers can be transformed into one, watermarks can be added, and more...
ja: MapProxy は、複数のソースからなる地図を予めレンダリングし、ローカルなキャッシュに格納することによってマッピングアプリケーションを高速化します。レイヤの透化、測地系の変更、複数のレイヤ統合、電子透かしの追加など、多くのことを可能にします。

source: MapProxy is flexible and scales from simple to complex use-cases: from a single tile cache for an :doc:`OpenLayers <openlayers_overview>` web client to a central SDI node that combines, unifies and accelerates dozens of distributed WMS services.
ja: MapProxy は柔軟で、単純なものから複雑なユースケースまでスケールします: 例えば、 :doc:`OpenLayers <openlayers_overview>` Web クライアントのための単一のタイルキャッシュから、数十の分散型 WMS サービスの結合、統合、高速化を行う、中央の空間データインフラストラクチャ SDI ノードまでスケールします。

source: Core Features
ja: 主な機能

source: Input sources:
ja: 入力ソース:

source: TMS, WMTS (TileCache, GeoWebcache, etc.)
ja: TMS, WMTS (TileCache, GeoWebcache など)

source: Mapserver and Mapnik (directly, without WMS)
ja: Mapserver 及び Mapnik (WMS 無しで直接的に)

source: any TileCache, Google Maps or Bing compatible source
ja: あらゆる TileCache, Google Maps または Bing 互換ソース

source: ArcGIS REST servers and compact cache files
ja: ArcGIS REST サーバと、コンパクトキャッシュファイル

source: Services:
ja: サービス:

source: Tile cache:
ja: タイルキャッシュ:

source: stores identical images just once (e.g. ocean tiles)
ja: 同一画像を一度のみ格納 (例えば、海のタイル画像)

source: cache tiles in the filesystem, MBTiles/SQLite, ArcGIS Compact Cache, S3, Redis, Riak, or CouchDB
ja: ファイルシステム, MBTile/SQLite, ArcGIS コンパクトキャッシュ, S3, Redis, Riak, CouchDB へのタイルのキャッシュ

source: add watermark to tiles
ja: タイルに透かしを追加

source: Source options:
ja: ソースのオプション:

source: limit sources to geometries (from Shapefile for example)
ja: ジオメトリへの (例えばシェープファイルからの) ソースの制限

source: add transparency to opaque layers
ja: 不透明なレイヤに透明度を追加

source: merge multiple sources
ja: 複数のソースのマージ

source: reproject WMS and tile sources to other SRS
ja: 他の SRS への WMS 及びタイルソースの最投影

source: WMS Features:
ja: WMS機能:

source: build layer trees from different sources
ja: 異なるソースからのレイヤーツリーの構築

source: create ``GetMap`` responses from cache with support for free-zooming and any projection (for any Desktop GIS)
ja: (あらゆるデスクトップ GIS のための) 自由なズームや、あらゆる座標系のサポートを伴う、キャッシュからの ``GetMap`` レスポンス生成

source: accelerates existing WMS 10 to 100 times
ja: 既存の WMS を10〜100倍高速化

source: respond to ``GetLegendGraphic`` requests
ja: ``GetLegendGraphic`` リクエストへの応答

source: cascade ``GetFeatureInfo`` requests with optional XSL transformations
ja: 任意の XSL 変換を伴う ``GetFeatureInfo`` リクエストへの転送

source: on-the-fly reprojection
ja: オンザフライによる再投影

source: convert WMS versions and image formats
ja: WMS バージョンや画像フォーマットの変換

source: Security:
ja: セキュリティ:

source: flexible and powerful authorization API
ja: 柔軟で強力な認証 API

source: fine-grained control over services and layers
ja: サービスおよびレイヤを、きめ細やかに管理

source: restrict access to polygon areas (for WMS and tile services)
ja: ポリゴン領域へのアクセス制限 (WMS とタイルサービス向け)

source: integrate with existing user databases and authentication methods
ja: 既存のユーザーデータベースや認証方法との統合

source: Powerful tools:
ja: 強力なツール:

source: efficient seed tool for cache pre-filling that can seed polygon areas with Shapefiles, GeoJSON, PostGIS or WKT geometries
ja: シェープファイル、GeoJSON、PostGIS、WKT ジオメトリのポリゴン領域へのシードが可能な事前タイルキャッシュのための効率的なシードツール。

source: export cached tiles to other formats
ja: キャッシュタイルの他のフォーマットへのエクスポート

source: calculate scales and show grid configurations
ja: 縮尺計算とグリッド設定の表示

source: Other features:
ja: 他の機能:

source: simple but powerful configuration format (YAML/JSON)
ja: 単純ながら強力な設定フォーマット (YAML/JSON)

source: OpenLayers based demo client
ja: OpenLayers ベースのデモクライアント

source: run multiple WMS services in one MapProxy instance
ja: 1つの MapProxy インスタンスで複数の WMS サービスを実行

source: add attribution lines to the images
ja: 画像に帰属ラインを追加

source: support for non-image raster data like DEMs
ja: DEM のような非画像ラスターデータをサポート

source: manipulate image bands to create grayscale- or false-color images
ja: グレイスケールもしくはフォールスカラー画像生成のための画像バンド操作

source: many more
ja: さらに多くの機能

source: Implemented Standards
ja: 実装されている標準規格

source: MapProxy implements the following open specifications:
ja: MapProxyは、以下のオープンな仕様を実装しています:

source: OGC WMTS 1.0.0 (KVP and RESTful)
ja: OGC WMTS 1.0.0 (KVP 及び RESTful)

source: Details
ja: 詳細

source: **Website:** https://mapproxy.org/
ja: **Webサイト:** https://mapproxy.org/

source: **Licence:** `Apache Software License 2.0 <https://www.apache.org/licenses/LICENSE-2.0.html>`_
ja: **ライセンス:** `Apache Software License 2.0 <https://www.apache.org/licenses/LICENSE-2.0.html>`_

source: **Software Version:** |version-mapproxy|
ja: **ソフトウェアバージョン:** |version-mapproxy|

source: **Supported Platforms:** Linux, Mac, Windows
ja: **対応プラットフォーム:** Linux, Mac, Windows

source: **Support:** https://mapproxy.org/support
ja: **サポート:** https://mapproxy.org/support

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/mapproxy_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/mapproxy_quickstart>`
